"""
Задание модели для делителя потока на два других
Уравнения:
in.G ~ out₁.G + out₂.G - Расход входящего потока равен сумме расходов двух выходящих потоков
in.T ~ out₁.T - температура входящего потока равна температуре первого выходящего потока
in.T ~ out₂.T - температура входящего потока равна температуре второго выходящего потока
in.p ~ out₁.p - давление входящего потока равно давлению первого выходящего потока
in.p ~ out₂.p - давление входящего потока равно давлению второго выходящего потока
"""

@mtkmodel Splitter begin
    @components begin
        in = Stream()
        out₁ = Stream()
        out₂ = Stream()
    end
    @equations begin
        in.G ~ out₁.G + out₂.G #материальный баланс 
        in.T ~ out₁.T
        in.T ~ out₂.T
        in.p ~ out₁.p
        in.p ~ out₂.p 
        # Δh ~ ζ * G / (S * (2 * g) * ρ)
        # ρ ~ PSI("D", "T", T, "P", p, sub)
    end
end