"""
Функция для задания параметров потока
G(t) - Расход массовый
p(t) - Давление
T(t) - Температура
"""

@connector Stream begin
    G(t), [connect = Flow] # Расход массовый
    p(t)
    T(t)
    # x(t)
end

"""
Функция для расчета параметров входящего и выходящего потоков, чтобы вместо задания каждого потока отдельно можно было написать @extend OneStream()
Δp, ΔT, G - уравнения для материального баланса
Переменные(меняются с течеием времни):
Δp(t)-изменение давления потока
ΔT(t)-изменение температуры потока
G(t)-расход потока 
Уравнения:
Δp ~ in.p - out.p - изменение давления это разность давлений приходящего и отходящего потока
ΔT ~ in.T - out.T - изменение температуры это разность температур приходящего и отходящего потока
G ~ in.G - расход потока равен расходу приходящего потока
in.G ~ out.G - расход приходящего и отходящего потока равны
"""

@mtkmodel OneStream begin
    @components begin
        in = Stream()
        out = Stream()
    end
    @variables begin #[guess = 0.0]
        Δp(t) 
        ΔT(t) #[guess = 0.0]
        G(t) #[guess = 0.1]
    end
    @equations begin
        Δp ~ in.p - out.p
        ΔT ~ in.T - out.T
        G ~ in.G
        in.G ~ out.G
    end
end