"""
Задание модели для регулирующего клапана на трубопроводе
Δh - потерянный напор, рассчитывается по формуле из лабораторного практикума по ПАХТу с. 69
ρ рассчитывается через CoolProp
Параметра:
ζ- коэффициент местного сопротивления
d-диаметр трубопровода
ρ-плотность жидкости
g-ускорение свободного емкости
Переменные(меняются с течением времни):
G(t) - расход
Δh(t) - изменение давления
Уравнения:
in.G ~ out.G - входящий расход равен выходящему
in.G ~ G - входящий расход равен расходу
in.T ~ out.T - входящая температура равна выходящей
in.p ~ out.p - входящее давление равно выходящему
Δh ~ ζ * G^2 * 4 / (pi^2 * d^2 * (2 * g) * ρ^2) - изменение давления
"""

@mtkmodel Valve begin
    @components begin
        in = Stream()
        out = Stream()
    end
    @parameters begin
       ζ = 1.5
       d = 0.3 
       ρ = 1000
       g = 9.8
    end
    @variables begin
        G(t)
        Δh(t)
        # ρ(t)
    end
    @equations begin
        # ρ ~ PSI("D", "T", in.T, "P", in.p, sub)
        in.G ~ out.G
        in.G ~ G
        in.T ~ out.T
        in.p ~ out.p
        Δh ~ ζ * G^2 * 4 / (pi^2 * d^2 * (2 * g) * ρ^2)
    end
end